<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.69">
 <TITLE>IPtables for Fun -- Implementare un firewall in linux: Pericoli -- ovvero, da cosa dovr&agrave; difendervi il firewall: Assunzioni errate</TITLE>
 <LINK HREF="iptables4fun-18.html" REL=next>
 <LINK HREF="iptables4fun-16.html" REL=previous>
 <LINK HREF="iptables4fun.html#toc6" REL=contents>
</HEAD>
<BODY>
<A HREF="iptables4fun-18.html">Avanti</A>
<A HREF="iptables4fun-16.html">Indietro</A>
<A HREF="iptables4fun.html#toc6">Indice</A>
<HR>
<H2>6.1 <A HREF="iptables4fun.html#toc6.1">Assunzioni errate</A></H2>

<P>Esistono poi alcuni errori che &egrave; facile commettere o miti che &egrave; bene sfatare prima di 
fare delle assunzioni errate a proposito della propria rete. Tenete quindi ben presente
che in una rete:
<UL>
<LI><B>tutti i dati possono essere falsificati</B> -- una ``scheda di rete'' non &egrave; altro
che un dispositivo fatto per scrivere su di una rete, un po' come una testina &egrave;
in grado di scrivere su dei dischi magnetici. I pacchetti non sono altro che dati che vengono
scritti su di una rete, e possono essere quindi falsificati o inventati di sana pianta. Nessuno
mi impedisce di ``scrivere'' con la mia scheda di rete dei pacchetti che indicano
come mittente il computer di qualcun altro o delle informazioni assolutamente insensate.
Scrivete quindi sempre delle regole che vietino o consentano anche ci&ograve; che pu&ograve;
sembrare ovvio. Per esempio,
se avete una intefaccia collegata alla rete 10.0.0.0/8, potreste scrivere come prima
regola ``vieta tutto ci&ograve; che viene dalla determinata scheda di rete ma che non
ha 10.0.0.0/8 come indirizzo del mittente''. Pu&ograve; sembrare stupido, ma questo vi
potrebbe evitare un sacco di problemi. Cosa succederebbe ad esempio se riceveste dei
pacchetti provenienti da 127.0.0.1? Con queste regole verrebbero immediatamente scartati,
ma senza (e con l'rp_filter disabilitato, vedi prossima sezione) &egrave; difficile valutare
cosa succederebbe (soprattutto su sistemi non linux -- 127.0.0.1 &egrave; un indirizzo di loopback).</LI>
<LI><B>un computer collegato ad una lan &egrave; in grado di vedere tutto il traffico in transito dalla
rete</B> -- se <I>foo</I> &egrave; collegato allo stesso switch
di <I>bar</I>, <I>foo</I> sar&agrave; in grado di vedere (sniffare, da ``fare sniffing'') tutto il 
traffico generato o ricevuto da <I>bar</I>, a partire
dalle email fino ad arrivare alle password per accedere ai siti ftp preferiti.
E' credenza comune che gli switch siano pi&ugrave; sicuri degli hub e che non consentano
questo tipo di operazioni. Si tratta per&ograve; di un'assunzione il pi&ugrave; delle
volte errata. Per maggiori informazioni vi consiglio di dare un'occhiata alla sezione dedicata
agli switch.</LI>
<LI><B>&egrave; possibile fare hijacking e spoofing</B> -- 
spoofing consiste nel fingersi qualcun altro. In una rete locale, &egrave; possibile
fare spoofing molto facilmente, per esempio con quello che viene definito ``arp spoofing''.
Anche volendo utilizzare tecniche di spoofing pi&ugrave; ``classiche'' basate sul protocollo tcp e ip
non esistono molti problemi: su una rete locale, potendo vedere i pacchetti, non c'&Egrave;
bisogno di indovinare alcun parametro, e non &egrave; quindi necessario utilizzare tecniche 
di ``blind spoofing'', notoriamente pi&ugrave; complesse.
L'hijacking consiste invece nel ``dirottare'' le connessioni di qualcun 
altro, dopo che sono state stabilite. L'utilit&agrave; dell'hijacking si dimostra 
ad esempio con protocolli non cifrati dove l'autenticazione viene effettuata 
in modo sicuro. Facendo sniffing non sarebbe possibile rubare la password, mentre utilizzando 
l'hijacking si potrebbe rubare la connessione dopo che l'amministratore (o il nostro bersaglio)
ha effettuato il login con successo, evitando il problema di aver bisogno di una password.</LI>
<LI><B>il protocollo udp &egrave; insicuro</B> -- se il tcp fa uso di syn e ack
per verificare e rendere le connessioni pi&ugrave; sicure e affidabili, l'udp 
non fa uso di nessuno di questi sistemi. E' quindi estremamente facile falsificare
delle trasmissioni udp, anche al di fuori di una lan. 

</LI>
<LI><B>il dns non &egrave; sicuro</B> -- Il protocollo dns fa uso del protocollo udp. E' 
quindi difficile considerarlo un protocollo sicuro (nonostante qualche precauzione 
venga presa), soprattutto in una lan, dove &egrave; estremamente facile falsificare dei 
pacchetti. In pi&ugrave; spesso si parte dall'assunzione che se la comunicazione 
tra client e dns &egrave; sicura allora i dati forniti dal dns sono corretti. Anche in
questo caso esistono delle tecniche (usate per lo pi&ugrave; in passato o con software
dns di pessima qualit&agrave; - compresi quelli inclusi in alcuni sistemi operativi) che 
consentono di inserire nel dns informazioni false (cache poisoning). Infine, l'amministratore
del vostro dns (o qualcuno in grado di gestire il dns da voi utilizzato), pu&ograve; 
modificare quasi a piacimento le associazioni tra nomi di dominio ed indirizzi ip forniti
da tale dns. Non si dovrebbe quindi mai fare affidamento sull'autenticit&agrave; e 
correttezza delle informazioni fornite da un dns.</LI>
<LI><B>tutti i dati, se non cifrati, possono essere intercettati e letti da 
chiunque si trovi tra il mittente e il destinatario</B></LI>
<LI><B>se un protocollo &egrave; cifrato, non &egrave; detto che sia sicuro</B> -- un problema
di internet e delle reti in generale non &egrave; soltanto il fatto che i dati 
possono essere facilmente intercettati. Anche ipotizzando che tutte le connessioni 
fossero cifrate, si creerebbe un problema di <I>autenticazione</I>. Per fare un esempio, se A deve 
mandare dei dati a B in maniera sicura, pu&ograve; creare un canale 
cifrato da A a B. Ma come fa A ad essere veramente sicura dell'identit&agrave; di B?
Se io fossi C, interessato ai dati trasmessi, potrei fingermi B (con
tecniche di spoofing o simili). In questo caso, la connessione tra A e B sarebbe
ancora cifrata, ma i dati arriverebbero in realt&agrave; a C. Il problema, in questo
caso, &egrave; l'autenticazione del server. Esistono diverse soluzioni
per questo problema. Con ssh, &egrave; consigliabile utilizzare sempre crittografia asimmetrica
(le famose chiavi di ssh) anzich&eacute; digitare le password e verificare sempre
il ``fingerprint'', un numero che rappresenta la chiave del computer remoto e mostrato
ad ogni connessione.
<P> 
Con protocolli come l'http, l'ftp, o la posta elettronica (sia pop che imap e smtp),
&egrave; possibile fare uso di ``certificati'' emessi da particolari autorit&agrave;
(autorit&agrave; che si fanno garanti della identit&agrave; dell'utilizzatore del
certificato) che provino l'identit&agrave; del server.</P>
<P>In Italia purtroppo, per risparmiare qualche euro, si &egrave; instaurata la pratica
di generare da s&eacute; i propri certificati senza utilizzare quelli emessi da
particolari autorit&agrave; anche in strutture che per dimensioni, per necessit&agrave;,
e per competenze tecniche dovrebbero per lo meno porsi qualche problema (parlo di 
universit&agrave;, enti pubblici, e di alcune strutture che costituiscono lo scheletro
di internet in Italia). Vorrei pertanto approfittare di questo documento per evidenziare 
che se un certificato non &egrave; emesso da una autorit&agrave; riconosciuta o da 
un'autorit&agrave; terza di cui avete ottenuto i certificati in maniera sicura 
(<B>non</B> scaricandoli da internet), la validit&agrave; del certificato stesso dovrebbe 
essere considerata <B>nulla</B>. Non ignorate quindi la finestrella di IE o Mozilla
che vi si presenta davanti dicendo che il certificato del sito non &egrave; valido:
chiunque potrebbe aver generato tale certificato
(man 1 openssl) ed essersi messo in mezzo tra voi ed il vostro sito. Non siate
tolleranti e mandate email all'amministratore di tale rete finch&eacute; non avr&agrave; 
acquistato un valido certificato!</P>
<P>Protocolli di autenticazione come kerberos invece, partono dal principio che non
&egrave; solo l'utente a dover provare la sua identit&agrave; ma anche il server remoto. 
In questo caso, se il server non &egrave; chi dichiara di essere non sar&agrave; in 
grado di decifrare i dati dell'utente stesso.</P>
</LI>
<LI><B>un firewall non &egrave; in grado di garantirvi la sicurezza</B> -- 
se sulla vostra rete usate sistemi operativi notoriamente insicuri,
potreste trovarvi facilmente dei troiani (virus particolari)
installati che consentono a terzi di controllare i vostri computer
da remoto, senza che il vostro firewall possa farci nulla. Una politica
di sicurezza deve quindi comprendere molto pi&ugrave; di un singolo firewall.</LI>
<LI><B>un sistema non &egrave; sicuro solo se non possono rubarvi dati</B> --
per esempio, potreste trovarvi nelle condizioni
di avere un servizio critico per la vostra azienda offerto da una macchina
estremamente sicura. Cosa succederebbe per&ograve; se un attaccante riuscisse
a sovraccaricarla di lavoro fino a bloccarla, pur senza riuscire 
ad entrarvici? Vi posso garantire che il vostro boss non sarebbe affatto felice...
In alcuni ambiti poi, un'interruzione di servizio potrebbe portare molti pi&ugrave;
danni di quanti potrebbe causarne un'intrusione.</LI>
<LI><B>esiste sempre qualcuno pi&ugrave; bravo, pi&ugrave; competente o pi&ugrave; 
furbo di voi</B> -- per
quante difese possiate approntare, esister&agrave; sempre quel bug di cui
non siete a conoscenza o quella persona in grado di ``bucare'' il vostro
sistema. Se avrete usato per bene le carte a vostra disposizione, sar&agrave; per lui una dura
partita ed il pi&ugrave; delle volte moller&agrave; prima di raggiungere
l'obiettivo. Sarete inoltre in grado di rendervi conto di quello
che sta succedendo e dei problemi che si sono venuti a creare.</LI>
<LI><B>non fidatevi</B> -- sebbene possa sembrare un'osservazione faziosa 
e quasi paranoica, ricordatevi che avere il codice sorgente dei programmi
che state utilizzando vi mette <I>direttamente</I> nelle condizioni di poter
verificare l'assenza di backdoor (porte sul retro, accessi lasciati dai programmatori)
o l'assenza di bug ed errori che potrebbero compromettere la sicurezza della vostra rete.
<P>Mettere a disposizione il codice sorgente di un determinato prodotto pu&ograve;
quindi essere considerato come un atto di fiducia nei vostri confronti
e costituire garanzia del buon operato dei programmatori coinvolti, che
dimostrano di non aver nulla da nascondere n&eacute; a voi ``clienti'' n&eacute; 
ad eventuali attaccanti. 
Una cassaforte non dovrebbe essere considerata sicura perch&egrave; il suo 
meccanismo &egrave; tenuto segreto (un meccanismo si pu&ograve; sempre studiare), 
ma perch&egrave; pur rendendone pubblico il funzionamento <I>nessuno &egrave; in
grado di aprirla</I> se non utilizzando la combinazione impostata. </P>
<P>Quando comprate un apparecchio come uno switch, un router o un firewall, provate a cercare
sul sito del produttore le procedure indicate per il recupero delle password 
dimenticate: alcune volte vi verr&agrave; detto di rendere l'apparecchiatura
raggiungibile tramite internet e di contattare il servizio di assistenza (non 
&egrave; uno scherzo). Questo
dovrebbe dirla lunga sull'assenza di backdoor e sulla sicurezza del prodotto.</P>
<P>Infine, se la vostra preoccupazione maggiore &egrave; la sicurezza, ricordatevi
che spesso questo non &egrave; l'interesse maggiore di chi 
vi vende un prodotto (e non sta a me ricordarvi che viviamo in un mondo dove 
l'economia &egrave; basata sul marketing e sulla massimizzazione dei guadagni). 
Non accontentatevi di belle parole o pubblicit&agrave;
accattivanti: se vi verr&agrave; rilasciato il codice sorgente sarete in grado
di verificare in prima persona la qualit&agrave; del prodotto.</P>

</LI>
</UL>

Se pu&ograve; tranquillizzarvi, in questo momento non mi viene pi&ugrave; in mente
nulla da aggiungere. Spero che questa notte riusciate a dormire sonni senza incubi...</P>
<P>Le solite raccomandazioni, ormai, credo che siano superflue: non scambiate mail con
password (&egrave; molto pi&ugrave; facile falsificare una mail che non intercettare
una comunicazione), scegliete password che non siano contenute in un dizionario e che
contengano caratteri maiuscoli e minuscoli, cifre e simboli, utilizzate tecnologie
di firma digitale e verificate l'identit&agrave; delle persone che vi richiedono
informazioni sensibili, magari richiamandole per telefono o utilizzando qualche
sorta di Web Of Trust.</P>

<HR>
<A HREF="iptables4fun-18.html">Avanti</A>
<A HREF="iptables4fun-16.html">Indietro</A>
<A HREF="iptables4fun.html#toc6">Indice</A>
</BODY>
</HTML>
